№штсдгву БЦшкуюрЮ
№штсдгву БМД53Д0ЧюрЮ

МД53Д0Ч мд53д03_вфдтщьукж
ищщд вфдтщьук_утфидув = афдыуж
мщшв ыуегз()
Х
  Ыукшфдюиупшт(9600)ж
  Цшкуюиупшт(17б 16)ж

  мд53д03_вфдтщьукюыуеЕшьущге(20)ж
  вфдтщьук_утфидув = мд53д03_вфдтщьукюштше()ж
  ша (!вфдтщьук_утфидув)
    Ыукшфдюзкштедт(ЭШтше вфдтщьук афшдув!Э)ж

  .. Ыефке сщтештгщгы ифсл-ещ-ифсл ьщву (ефлу куфвштпы фы
  .. афые фы зщыышиду)ю  Ещ гыу сщтештгщгы ешьув ьщву
  .. штыеуфвб зкщмшву ф вуышкув штеук-ьуфыгкуьуте зукшщв шт
  .. ьы (уюпю ыутыщкюыефкеСщтештгщгы(100))ю
  мд53д03_вфдтщьукюыефкеСщтештгщгы()ж
Ъ

мщшв дщщз()
Х
  Ыукшфдюзкште(мд53д03_вфдтщьукюкуфвКфтпуСщтештгщгыЬшддшьуеукы())ж
  ша (мд53д03_вфдтщьукюешьущгеЩссгккув())
  Х
    Ыукшфдюзкште(Э ЕШЬУЩГЕЭ)ж
  Ъ

  Ыукшфдюзкштедт()ж
Ъ